Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_rights/index.html.txt.tmx
Source language: en
Languages: ga

source: Your rights as a consumer in Ireland
ga: Cearta Tomhaltóirí in Éirinn

source: Consumer legislation is described here along with information about deposits and redress mechanisms
ga: Is iad dlíthe na hÉireann agus an AE a thugann cosaint do chearta thomhaltóirí earraí agus seirbhísí in Éirinn

source: Your rights when you buy a service
ga: Do chearta nuair a cheannaíonn tú seirbhís

source: Consumer Protection Act 2007
ga: An tAcht um Chosaint Tomhaltóirí 2007

source: The Consumer Protection Act put the EU Directive on unfair commercial practices into national law and it made various changes to consumer legislation
ga: Chuir an tAcht um Chosaint Tomhaltóirí Treoir an AE i leith cleachtas tráchtála éagórach i bhfeidhm sa dlí náisiúnta agus rinne sé athruithe éagsúla ar ár ndlíthe tomhaltóirí

source: There are a number of statutory and voluntary consumer bodies to inform you of your rights as a consumer
ga: Tá roinnt eagras reachtúil agus deonach do thomhaltóirí in Éirinn chun túa chur ar an eolas faoi do chearta mar thomhaltóir

source: This section describes the main organisations that can advise you of your rights as a consumer
ga: Tuairiscítear sa roinn seo ar na príomheagrais a fhéadann comhairle a thabhairt duit faoi do chearta mar thomhaltóir

source: All consumers purchasing goods in the EU are entitled to some basic rights
ga: Cearta Tomhaltóirí agus siopadóireacht treasteorann in Aontas na hEorpa

source: Find out about your rights if you buy goods from or in another EU Member State
ga: Tá cur síos sa cháipéis seo ar do chearta mar thomhaltóir má cheanaíonn tú earraí ó Bhallstát eile den AE

source: This document discusses the rules governing distance selling, whether it involves selling via the Internet, e-mail, fax, telephone, mail order. It tells you what your rights are when you shop online
ga: Tá cur síos sa cháipéis seo ar na rialacha a bhaineann le ciandíolachán, bíodh sin ina dhíolachán ar an Idirlíon, tríd ríomh-phost, facs, orduithe tugtha ar an nguthán &rl

source: Unfair terms in consumer contracts
ga: Téarmaí éagóracha i gconarthaí tomhaltóirí

source: An unfair term in a standard consumer contract is a term that is significantly weighted against the consumer
ga: Tá cosaint dhlíthiúil ag tomhaltóirí na hÉireann in aghaidh téarmaí éagóracha sna conarthaí a déantar leo

source: See what protection there is for consumers from unfair terms in contracts
ga: Céard is téarma éagórach ann i gconradh le tomhaltóir? Faigh amach faoi do chearta anseo

source: The EU Unfair Commercial Practices Directive deals with unfair business-to-consumer commercial practices. The Consumer Protection Act 2007 provides for its implementation in Ireland
ga: Baineann Treoir an AE i leith Cleachtas Tráchtála Éagórach (Treoir 2005/28/CE an 11 Bealtaine 2005) le cleachtais tráchtála gnó-go-tomhaltóir éagóracha (ní bhaineann sé le gnó idir gnóthaí)

source: In Ireland, a consumer hire agreement is an agreement between a customer and a financial institution or a finance company
ga: Pléann an cháipéis seo na coinníollacha a rialaíonn comhaontuithe fruilithe tomhaltóra

source: A guarantee supplements your consumer rights but can be useful if you receive an item as a gift. There may be a charge for an extended warranty but you should not feel obliged to buy one
ga: Má tá banna nó urrús ag earra beidh cosaint bhreise agat agus beidh na cearta céanna seo ag úinéir an earra e le linn tréimhse na hurraíochta

source: A deposit is a sum of money paid to a retailer or supplier of services to indicate an intention to buy a product or service
ga: Is éard is éarlais ann ná íocaíocht a thugtar do mhiondíoltóir nó soláthraí seirbhísí mar léiriú go bhfuil sé beartaithe earra nó seirbhís a cheannach

source: Find out what the rules are with regard to deposits
ga: Seo iad na rialacha a bhaineann le héarlaisí

source: Consumers in Ireland and the EU are protected from false or misleading advertising
ga: Tugtar cosaint do thomhaltóirí in Éirinn agus san AE ón bhfógraíocht bhréagach mhíthreorach

source: Find out what the rules are governing advertisers and what to do if you have been deceived by an advert
ga: Foghlaim faoi na rialacha a rialaíonn fógróirí agus an méid le déanamh má cuireadh dallamullóg ort le fógra

source: Advertising Standards Authority for Ireland
ga: An tÚdarás na gCaighdeán Fógraíochta d'Éirinn

source: The Advertising Standards Authority for Ireland is an independent regulatory body set up to ensure that all advertisements are legal, decent, honest and truthful
ga: Cuireann an cháipéis seo cur síos ar obair Údarás na gCaighdeán Fógraíochta d'Éirinn agus conas gearán a dhéanamh faoi fhógra

source: Consumer protection codes and mortgages
ga: Cóid um chosaint tomhaltóirí agus morgáistí

source: Mortgage lenders must adhere to codes of conduct when dealing with customers. Find out more
ga: Ní mór d'iasachtóirí morgáiste cloí le cóid reachtúla

source: This document is in: Housing > Owning a home > Mortgage arrears
ga: This document is in: Tithíocht > Ag ceannach tí > Riaráistí morgáiste

source: Most Read in "Consumer Affairs"
ga: Ábhar is mó éilimh i "Gnóthaí Tomhaltóirí"

source: Display of prices for goods and services
ga: Carr athláimhe a cheannach

source: Replacements, refunds and credit notes
ga: Taispeáint praghsanna d'earraí agus seirbhísí
